#### BuiltInFailures.FabricAreaFailures Members

---

|  |
| --- |
| BuiltInFailures FabricAreaFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures FabricAreaFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | FabricAreaLapSplicesIncorrect | Fabric Area lap splice is incorrect. |
| Public property Static member | FabricAreaOutSideOfHost | Fabric Area is sketched completely outside of its host. |

# See Also

BuiltInFailures FabricAreaFailures Class

Autodesk.Revit.DB Namespace